{
  "data": {
      "user": {
          "name": "Josh Davis",
          "bio": "Currently a senior leader in the FinTech space, I grew up over the last 20+ years working back end systems in IT, now specializing in DevOps and Developer Experience under the Platform group. I have a record of improving everything I touch by not letting perfect get in the way of progress.\r\n",
          "avatarUrl": "/static/media/1720828341711.jfif", 
          "location": "Carleton, MI", 
          "pinnedItems": {
              "totalCount": 4,
              "edges": [
                {
                    "node": {
                        "name": "Developer Productivity & Operational Excellence",
                        "description": "Expert in implementing a vision to enhance developer happiness by reducing friction. Key accomplishments:\
                                        \n* **Reusable Workflows for GitHub Actions:** Streamlined development and enabled faster deployments for Java and Node.js applications.\
                                        \n* **ArgoCD Adoption for New Container Apps:** Improved deployment reliability and scalability, reducing downtime risks and enhancing overall system stability. \
                                        \n* **Portable Environments Project:** Standardized development environments, enhancing developer experience and productivity.\
                                        \n* **Data Refresh Process Automation:** Explored automation and streamlining with tonic.AI and Ansible, reducing manual effort and potential errors.\
                                        \n* **Dynatrace Migration:** Led a complex project to migrate to a new monitoring and observability platform, ensuring seamless transition and improved insights into system performance.",
                        "forkCount": 0, 
                        "stargazers": {
                            "totalCount": 0 
                        },
                        "url": "https://www.linkedin.com/in/josh-davis101/", 
                        "id": "Skill1", 
                        "diskUsage": 0,
                        "primaryLanguage": null 
                    }
                },
                {
                    "node": {
                        "name": "Transformational Leadership & Team Empowerment",
                        "description": "Built and led high-performing cross-functional teams (40+ engineers), fostering collaboration, and empowering team members to achieve their full potential. Key achievements include: \
                                        \n* **Successful Onboarding and Integration of New Team Members:** Rapidly integrated new hires, ensuring their swift contributions to team goals. \
                                        \n* **Mitigated Attrition Risk During Leadership Transition:** Stepped up to manage the DevOps team during a critical period, stabilizing the team and ensuring continuity. \
                                        \n* **Facilitated Seamless Team Transitions:** Successfully transitioned the DBRE team to SRE and oversaw the Middleware team's move to DevEx, enhancing capabilities and alignment. \
                                        \n* **Mentored and Developed Future Leaders:** Provided guidance and support to team members, fostering their professional growth and creating a pipeline of future leaders.",
                        "forkCount": 0,
                        "stargazers": {
                            "totalCount": 0
                        },
                        "url": "https://www.linkedin.com/in/josh-davis101/",
                        "id": "Skill2",
                        "diskUsage": 0,
                        "primaryLanguage": null 
                    }
                },
                {
                    "node": {
                        "name": "Strategic Vision & Process Innovation",
                        "description": "Experienced in identifying bottlenecks, creating new processes, and driving continuous improvement initiatives to enhance operational efficiency and reduce costs. Key projects include: \
                                        \n* **Implemented APM and Observability:** Improved development velocity and operational efficiency through proactive issue detection and faster troubleshooting. \
                                        \n* **Led CI/CD and Infrastructure Automation:** Modernized pipelines and streamlined deployments, increasing efficiency and reducing manual errors. \
                                        \n* **Transitioned from Jenkins to GitOps with ArgoCD:** Implemented modern deployment strategies, improving reliability and scalability. \
                                        \n* **Migrated from Bitbucket to GitHub:** Streamlined version control and collaboration for development teams. \
                                        \n* **Automated Property File Deployment with Ansible:** Enhanced configuration management efficiency and reduced manual errors.",
                        "forkCount": 0,
                        "stargazers": {
                            "totalCount": 0
                        },
                        "url": "https://www.linkedin.com/in/josh-davis101/",
                        "id": "Skill3",
                        "diskUsage": 0,
                        "primaryLanguage": null 
                    }
                },
                {
                    "node": {
                        "name": "Cloud Expertise & DevOps Mastery",
                        "description": "Deep understanding of cloud platforms (AWS, Azure) and expertise in DevOps practices. Proficient in:\
                                        \n* **Cloud Technologies:** AWS (cognito, EC2, S3, EKS, Fargate, Lambda, Secrets Manager, Parameter Store), Azure (API management gateway, Microsoft Entra ID)\
                                        \n* **DevOps:** GitOps, CI/CD pipelines, infrastructure automation (Terraform, Ansible, Python)\
                                        \n* **Observability:** Dynatrace, Splunk\
                                        \n* **Key projects:** \
                                        \n    * Transitioned Database Secrets Management to DBRE, enhancing security and control.\
                                        \n    * Implemented FICO SLOs in Dynatrace, enabling proactive monitoring and performance optimization.\
                                        \n    * Set up CAPS User Experience Monitoring in Dynatrace, gaining insights into user interactions and identifying areas for improvement.",
                        "forkCount": 0,
                        "stargazers": {
                            "totalCount": 0
                        },
                        "url": "https://www.linkedin.com/in/josh-davis101/",
                        "id": "Skill4",
                        "diskUsage": 0,
                        "primaryLanguage": null 
                    }
                },
                {
                    "node": {
                        "name": "Incident Response & Mitigation",
                        "description": "Successfully led incident response and resolution efforts, minimizing downtime and business impact. Key examples:\
                                        \n* **Production Incident:** Resolved a critical replication issue caused by an admin error, collaborating with the DBA team to restore system functionality.\
                                        \n* **AMQ Broker Incident:** Identified and addressed slow query issues, ensuring timely resolution and preventing further disruptions.",
                        "forkCount": 0,
                        "stargazers": {
                            "totalCount": 0
                        },
                        "url": "https://www.linkedin.com/in/josh-davis101/",
                        "id": "Skill5",
                        "diskUsage": 0,
                        "primaryLanguage": null 
                    }
                },
                {
                    "node": {
                        "name": "Mentorship & Technical Guidance",
                        "description": "Provided technical leadership and mentorship to team members, fostering their growth and development. Key examples:\
                                        \n* **Upskilling DBA Team Members:** Trained team members in cloud-native technologies, enhancing their skillset and enabling them to contribute to modernization efforts.\
                                        \n* **Mentored DevOps Team:** Guided the team in adopting new tools and technologies, improving their capabilities and efficiency.\
                                        \n* **Collaborated with Cross-functional Teams:** Worked closely with various teams (e.g., engineering, DBA) to align on technical decisions and ensure successful project delivery.",
                        "forkCount": 0,
                        "stargazers": {
                            "totalCount": 0
                        },
                        "url": "https://www.linkedin.com/in/josh-davis101/",
                        "id": "Skill6",
                        "diskUsage": 0,
                        "primaryLanguage": null 
                    }
                }
            ]
          }
      }
  }
}